pandas 的 DataFrame.drop 函数提供了一种灵活的方式来删除 DataFrame 中的指定标签（行或列）。与 dropna 主要用于移除缺失数据不同，drop 可以用来删除任何不需要的行或列，无论它们是否包含缺失值。

DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')

**功能**
drop 函数用于删除 DataFrame 中的行或列。

**参数**
labels: 单个标签或标签列表。这是你想要从行或列中删除的标签。
axis: {0 or 'index', 1 or 'columns'}, 默认为0。0 或 'index' 表示删除行，1 或 'columns' 表示删除列。
index: 单个标签或标签列表。这是一个与 labels 和 axis=0 等价的便捷参数。
columns: 单个标签或标签列表。这是一个与 labels 和 axis=1 等价的便捷参数。
level: int 或者 level 名称，可选。如果 DataFrame 是 MultiIndex （层次化索引），那么这个参数用来指定在哪个层次上匹配标签。
inplace: bool，默认为False。如果为 True，则在原地修改 DataFrame，不返回任何值。
errors: {'ignore', 'raise'}, 默认为 'raise'。如果设置为 'raise'，则当尝试删除的标签不存在时会抛出错误；如果设置为 'ignore'，则即使标签不存在也不会抛出错误，操作将继续。

In [2]:
import numpy as np
import pandas as pd

df = pd.DataFrame(
    {'name': ['张三', '李四', '王五', '马六', '赵七'],
     'sex': ['male', 'female', np.nan, 'male', 'female'],
     'age': [10, np.nan, 14, np.nan, 34]
    }
)
df

  name     sex   age
0   张三    male  10.0
1   李四  female   NaN
2   王五     NaN  14.0
3   马六    male   NaN
4   赵七  female  34.0

删除指定行

In [3]:
df.drop([0, 1, 3], axis=0)

  name     sex   age
2   王五     NaN  14.0
4   赵七  female  34.0

In [ ]:
删除指定列，需要用列名

In [6]:
df.drop(['name', 'sex'], axis=1)

    age
0  10.0
1   NaN
2  14.0
3   NaN
4  34.0

也可以不指定axis，这时用数组就是行，用列名就是列

In [7]:
df.drop([1, 3], axis=0)

  name     sex   age
0   张三    male  10.0
2   王五     NaN  14.0
4   赵七  female  34.0

In [9]:
df.drop(['sex'], axis=1)

  name   age
0   张三  10.0
1   李四   NaN
2   王五  14.0
3   马六   NaN
4   赵七  34.0